Revit 2027 API
BuiltInFailures.FamilyFailures.TryingToAttachWhenJoined Property
 The column and target are joined. The attachment has been removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TryingToAttachWhenJoined { get; }
Public Shared ReadOnly Property TryingToAttachWhenJoined As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TryingToAttachWhenJoined {
	FailureDefinitionId^ get ();
}
static member TryingToAttachWhenJoined : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace